; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	infrared0 - mode
	image3 - mode
	thermograph2 - mode
	thermograph1 - mode
	GroundStation5 - direction
	Star26 - direction
	Star8 - direction
	GroundStation15 - direction
	Star12 - direction
	GroundStation6 - direction
	Star23 - direction
	GroundStation4 - direction
	Star20 - direction
	GroundStation14 - direction
	Star24 - direction
	Star11 - direction
	Star27 - direction
	Star1 - direction
	Star3 - direction
	Star16 - direction
	Star17 - direction
	GroundStation19 - direction
	GroundStation2 - direction
	GroundStation10 - direction
	GroundStation13 - direction
	Star7 - direction
	Star9 - direction
	Star25 - direction
	GroundStation22 - direction
	GroundStation18 - direction
	GroundStation28 - direction
	Star0 - direction
	Star21 - direction
	Star29 - direction
	Star30 - direction
	Planet31 - direction
	Planet32 - direction
	Phenomenon33 - direction
	Planet34 - direction
	Planet35 - direction
	Star36 - direction
	Phenomenon37 - direction
	Planet38 - direction
	Star39 - direction
	Star40 - direction
	Planet41 - direction
	Planet42 - direction
	Phenomenon43 - direction
	Planet44 - direction
	Phenomenon45 - direction
	Planet46 - direction
	Planet47 - direction
	Phenomenon48 - direction
	Star49 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star23)
	(calibration_target instrument0 GroundStation14)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 GroundStation22)
	(calibration_target instrument0 Star9)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star17)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 Star12)
	(calibration_target instrument2 Star21)
	(calibration_target instrument2 Star25)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 Star27)
	(supports instrument3 infrared0)
	(supports instrument3 image3)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star17)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 GroundStation15)
	(calibration_target instrument3 GroundStation18)
	(calibration_target instrument3 Star23)
	(calibration_target instrument3 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument4 image3)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation22)
	(calibration_target instrument4 Star24)
	(calibration_target instrument4 GroundStation13)
	(calibration_target instrument4 Star17)
	(calibration_target instrument4 GroundStation10)
	(calibration_target instrument4 GroundStation18)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 Star16)
	(calibration_target instrument4 GroundStation19)
	(supports instrument5 image3)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation10)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 Star27)
	(calibration_target instrument5 Star12)
	(calibration_target instrument5 GroundStation14)
	(calibration_target instrument5 Star0)
	(supports instrument6 thermograph1)
	(supports instrument6 image3)
	(calibration_target instrument6 Star16)
	(calibration_target instrument6 Star20)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 Star7)
	(calibration_target instrument6 Star23)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 Star3)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star16)
	(supports instrument7 image3)
	(calibration_target instrument7 Star27)
	(calibration_target instrument7 Star11)
	(calibration_target instrument7 Star24)
	(calibration_target instrument7 Star21)
	(calibration_target instrument7 GroundStation14)
	(calibration_target instrument7 Star17)
	(supports instrument8 image3)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 Star7)
	(calibration_target instrument8 GroundStation13)
	(calibration_target instrument8 GroundStation10)
	(calibration_target instrument8 GroundStation2)
	(calibration_target instrument8 GroundStation19)
	(calibration_target instrument8 Star17)
	(calibration_target instrument8 Star16)
	(calibration_target instrument8 Star3)
	(calibration_target instrument8 Star1)
	(supports instrument9 thermograph2)
	(supports instrument9 thermograph1)
	(supports instrument9 image3)
	(calibration_target instrument9 Star29)
	(calibration_target instrument9 Star21)
	(calibration_target instrument9 Star0)
	(calibration_target instrument9 GroundStation28)
	(calibration_target instrument9 GroundStation18)
	(calibration_target instrument9 GroundStation22)
	(calibration_target instrument9 Star25)
	(calibration_target instrument9 Star9)
	(calibration_target instrument9 Star7)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation18)
)
(:goal (and
	(have_image Star30 thermograph1)
	(have_image Planet31 image3)
	(have_image Planet32 thermograph2)
	(have_image Phenomenon33 thermograph2)
	(have_image Planet34 infrared0)
	(have_image Planet35 thermograph2)
	(have_image Star36 thermograph2)
	(have_image Phenomenon37 infrared0)
	(have_image Planet38 thermograph1)
	(have_image Star39 infrared0)
	(have_image Star40 thermograph2)
	(have_image Planet41 infrared0)
	(have_image Planet42 image3)
	(have_image Phenomenon43 image3)
	(have_image Planet44 image3)
	(have_image Phenomenon45 thermograph2)
	(have_image Planet46 infrared0)
	(have_image Planet47 thermograph2)
	(have_image Phenomenon48 thermograph2)
	(have_image Star49 thermograph2)
))

)

; plan
1. (switch_on instrument9 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument9)
   goals met: 0 of 20
2. (calibrate satellite2 instrument9 groundstation18)
   added: (calibrated instrument9)
   goals met: 0 of 20
3. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 20
4. (calibrate satellite1 instrument4 star16)
   added: (calibrated instrument4)
   goals met: 0 of 20
5. (turn_to satellite2 phenomenon33 groundstation18)
   deleted: (pointing satellite2 groundstation18)
   added: (pointing satellite2 phenomenon33)
   goals met: 0 of 20
6. (take_image satellite2 phenomenon33 instrument9 thermograph2)
   added: (have_image phenomenon33 thermograph2)
   goals met: 1 of 20
7. (turn_to satellite2 phenomenon43 phenomenon33)
   deleted: (pointing satellite2 phenomenon33)
   added: (pointing satellite2 phenomenon43)
   goals met: 1 of 20
8. (take_image satellite2 phenomenon43 instrument9 image3)
   added: (have_image phenomenon43 image3)
   goals met: 2 of 20
9. (turn_to satellite2 phenomenon45 phenomenon43)
   deleted: (pointing satellite2 phenomenon43)
   added: (pointing satellite2 phenomenon45)
   goals met: 2 of 20
10. (take_image satellite2 phenomenon45 instrument9 thermograph2)
   added: (have_image phenomenon45 thermograph2)
   goals met: 3 of 20
11. (turn_to satellite2 phenomenon48 phenomenon45)
   deleted: (pointing satellite2 phenomenon45)
   added: (pointing satellite2 phenomenon48)
   goals met: 3 of 20
12. (take_image satellite2 phenomenon48 instrument9 thermograph2)
   added: (have_image phenomenon48 thermograph2)
   goals met: 4 of 20
13. (turn_to satellite2 planet31 phenomenon48)
   deleted: (pointing satellite2 phenomenon48)
   added: (pointing satellite2 planet31)
   goals met: 4 of 20
14. (take_image satellite2 planet31 instrument9 image3)
   added: (have_image planet31 image3)
   goals met: 5 of 20
15. (turn_to satellite2 planet32 planet31)
   deleted: (pointing satellite2 planet31)
   added: (pointing satellite2 planet32)
   goals met: 5 of 20
16. (take_image satellite2 planet32 instrument9 thermograph2)
   added: (have_image planet32 thermograph2)
   goals met: 6 of 20
17. (turn_to satellite2 planet35 planet32)
   deleted: (pointing satellite2 planet32)
   added: (pointing satellite2 planet35)
   goals met: 6 of 20
18. (take_image satellite2 planet35 instrument9 thermograph2)
   added: (have_image planet35 thermograph2)
   goals met: 7 of 20
19. (turn_to satellite2 planet38 planet35)
   deleted: (pointing satellite2 planet35)
   added: (pointing satellite2 planet38)
   goals met: 7 of 20
20. (take_image satellite2 planet38 instrument9 thermograph1)
   added: (have_image planet38 thermograph1)
   goals met: 8 of 20
21. (turn_to satellite2 planet42 planet38)
   deleted: (pointing satellite2 planet38)
   added: (pointing satellite2 planet42)
   goals met: 8 of 20
22. (take_image satellite2 planet42 instrument9 image3)
   added: (have_image planet42 image3)
   goals met: 9 of 20
23. (turn_to satellite2 planet44 planet42)
   deleted: (pointing satellite2 planet42)
   added: (pointing satellite2 planet44)
   goals met: 9 of 20
24. (take_image satellite2 planet44 instrument9 image3)
   added: (have_image planet44 image3)
   goals met: 10 of 20
25. (turn_to satellite2 planet47 planet44)
   deleted: (pointing satellite2 planet44)
   added: (pointing satellite2 planet47)
   goals met: 10 of 20
26. (take_image satellite2 planet47 instrument9 thermograph2)
   added: (have_image planet47 thermograph2)
   goals met: 11 of 20
27. (turn_to satellite2 star30 planet47)
   deleted: (pointing satellite2 planet47)
   added: (pointing satellite2 star30)
   goals met: 11 of 20
28. (take_image satellite2 star30 instrument9 thermograph1)
   added: (have_image star30 thermograph1)
   goals met: 12 of 20
29. (turn_to satellite2 star36 star30)
   deleted: (pointing satellite2 star30)
   added: (pointing satellite2 star36)
   goals met: 12 of 20
30. (take_image satellite2 star36 instrument9 thermograph2)
   added: (have_image star36 thermograph2)
   goals met: 13 of 20
31. (turn_to satellite2 star40 star36)
   deleted: (pointing satellite2 star36)
   added: (pointing satellite2 star40)
   goals met: 13 of 20
32. (take_image satellite2 star40 instrument9 thermograph2)
   added: (have_image star40 thermograph2)
   goals met: 14 of 20
33. (turn_to satellite2 star49 star40)
   deleted: (pointing satellite2 star40)
   added: (pointing satellite2 star49)
   goals met: 14 of 20
34. (take_image satellite2 star49 instrument9 thermograph2)
   added: (have_image star49 thermograph2)
   goals met: 15 of 20
35. (turn_to satellite1 phenomenon37 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 phenomenon37)
   goals met: 15 of 20
36. (take_image satellite1 phenomenon37 instrument4 infrared0)
   added: (have_image phenomenon37 infrared0)
   goals met: 16 of 20
37. (turn_to satellite1 planet34 phenomenon37)
   deleted: (pointing satellite1 phenomenon37)
   added: (pointing satellite1 planet34)
   goals met: 16 of 20
38. (take_image satellite1 planet34 instrument4 infrared0)
   added: (have_image planet34 infrared0)
   goals met: 17 of 20
39. (turn_to satellite1 planet41 planet34)
   deleted: (pointing satellite1 planet34)
   added: (pointing satellite1 planet41)
   goals met: 17 of 20
40. (take_image satellite1 planet41 instrument4 infrared0)
   added: (have_image planet41 infrared0)
   goals met: 18 of 20
41. (turn_to satellite1 planet46 planet41)
   deleted: (pointing satellite1 planet41)
   added: (pointing satellite1 planet46)
   goals met: 18 of 20
42. (take_image satellite1 planet46 instrument4 infrared0)
   added: (have_image planet46 infrared0)
   goals met: 19 of 20
43. (turn_to satellite1 star39 planet46)
   deleted: (pointing satellite1 planet46)
   added: (pointing satellite1 star39)
   goals met: 19 of 20
44. (take_image satellite1 star39 instrument4 infrared0)
   added: (have_image star39 infrared0)
   goals met: 20 of 20
